zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PORT.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_ENETC_PORT.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_ENETC_PORT
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_ENETC_PORT_H_)  /* Check if memory map has not been already included */
#define S32K566_ENETC_PORT_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- ENETC_PORT Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENETC_PORT_Peripheral_Access_Layer ENETC_PORT Peripheral Access Layer
 * @{
 */

/** ENETC_PORT - Size of Registers Arrays */
#define ENETC_PORT_TCT_NUM_COUNT                  8u

/** ENETC_PORT - Register Layout Typedef */
typedef struct ENETC_PORT_Struct {
  __I  uint32_t PCAPR;                             /**< Port capability register, offset: 0x0 */
  __I  uint32_t PMCAPR;                            /**< Port MAC capability register, offset: 0x4 */
  __I  uint32_t PIOCAPR;                           /**< Port I/O capability register, offset: 0x8 */
  uint8_t RESERVED_0[4];
  __IO uint32_t PCR;                               /**< Port configuration register, offset: 0x10 */
  uint8_t RESERVED_1[12];
  __IO uint32_t PMAR0;                             /**< Port MAC address register 0, offset: 0x20 */
  __IO uint32_t PMAR1;                             /**< Port MAC address register 1, offset: 0x24 */
  uint8_t RESERVED_2[40];
  __IO uint32_t PTAR;                              /**< Port TPID acceptance register, offset: 0x50 */
  __IO uint32_t PQOSMR;                            /**< Port QoS mode register, offset: 0x54 */
  uint8_t RESERVED_3[40];
  __IO uint32_t PPCR;                              /**< Port parser configuration register, offset: 0x80 */
  __IO uint32_t PIPFCR;                            /**< Port ingress port filter configuration register, offset: 0x84 */
  uint8_t RESERVED_4[24];
  __IO uint32_t PSGCR;                             /**< Port stream gate configuration register, offset: 0xA0 */
  uint8_t RESERVED_5[92];
  __IO uint32_t POR;                               /**< Port operational register, offset: 0x100 */
  __I  uint32_t PSR;                               /**< Port status register, offset: 0x104 */
  __IO uint32_t PRXSDUOR;                          /**< Port receive SDU overhead register, offset: 0x108 */
  __IO uint32_t PTXSDUOR;                          /**< Port transmit SDU overhead register, offset: 0x10C */
  __IO uint32_t PTGSCR;                            /**< Port time gate scheduling control register, offset: 0x110 */
  __I  uint32_t PTGAGLSR;                          /**< Port time gate scheduling admin gate list status register, offset: 0x114 */
  __I  uint32_t PTGAGLLR;                          /**< Port time gate scheduling admin gate list length register, offset: 0x118 */
  __I  uint32_t PTGOGLLR;                          /**< Port time gating operational gate list length register, offset: 0x11C */
  __IO uint32_t PTGSATOR;                          /**< Port time gate scheduling advance time offset register, offset: 0x120 */
  uint8_t RESERVED_6[20];
  __IO uint32_t PDGSR;                             /**< Port default gate state register, offset: 0x138 */
  uint8_t RESERVED_7[132];
  __I  uint32_t PRXDCR;                            /**< Port Rx discard count register, offset: 0x1C0 */
  uint8_t RESERVED_8[4];
  __IO uint32_t PRXDCRR0;                          /**< Port Rx discard count reason register 0, offset: 0x1C8 */
  __IO uint32_t PRXDCRR1;                          /**< Port Rx discard count reason register 1, offset: 0x1CC */
  uint8_t RESERVED_9[48];
  struct ENETC_PORT_TCT_NUM {                      /* offset: 0x200, array step: 0x20 */
    __I  uint32_t PTGSTCSR;                          /**< Port time gate scheduling traffic class 0 status register..Port time gate scheduling traffic class 7 status register, array offset: 0x200, array step: 0x20 */
    __I  uint32_t PTGSTCOCR;                         /**< Port time gate scheduling traffic class 0 overrun counter register..Port time gate scheduling traffic class 7 overrun counter register, array offset: 0x204, array step: 0x20 */
    __IO uint32_t PTCTMSDUR;                         /**< Port traffic class 0 transmit maximum SDU register..Port traffic class 7 transmit maximum SDU register, array offset: 0x208, array step: 0x20 */
    uint8_t RESERVED_0[4];
    __IO uint32_t PTCCBSR0;                          /**< Port transmit traffic class 0 credit based shaper register 0..Port transmit traffic class 7 credit based shaper register 0, array offset: 0x210, array step: 0x20 */
    __IO uint32_t PTCCBSR1;                          /**< Port traffic class 0 credit based shaper register 1..Port traffic class 7 credit based shaper register 1, array offset: 0x214, array step: 0x20 */
    __IO uint32_t PTCCBSR2;                          /**< Port transmit traffic class 0 credit based shaper register 2..Port transmit traffic class 7 credit based shaper register 2, array offset: 0x218, array step: 0x20 */
    uint8_t RESERVED_1[4];
  } TCT_NUM[ENETC_PORT_TCT_NUM_COUNT];
  uint8_t RESERVED_10[312];
  __IO uint32_t PPCPDEIMR;                         /**< Port PCP DEI mapping register, offset: 0x438 */
  uint8_t RESERVED_11[36];
  __IO uint32_t PISIDCR;                           /**< Port ingress stream identification configuration register, offset: 0x460 */
} ENETC_PORT_Type, *ENETC_PORT_MemMapPtr;

/** Number of instances of the ENETC_PORT module. */
#define ENETC_PORT_INSTANCE_COUNT                (1u)

/* ENETC_PORT - Peripheral instance base addresses */
/** Peripheral NETC__ENETC0_PORT base address */
#define IP_NETC__ENETC0_PORT_BASE                (0x6D094000u)
/** Peripheral NETC__ENETC0_PORT base pointer */
#define IP_NETC__ENETC0_PORT                     ((ENETC_PORT_Type *)IP_NETC__ENETC0_PORT_BASE)
/** Array initializer of ENETC_PORT peripheral base addresses */
#define IP_ENETC_PORT_BASE_ADDRS                 { IP_NETC__ENETC0_PORT_BASE }
/** Array initializer of ENETC_PORT peripheral base pointers */
#define IP_ENETC_PORT_BASE_PTRS                  { IP_NETC__ENETC0_PORT }

/* ----------------------------------------------------------------------------
   -- ENETC_PORT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENETC_PORT_Register_Masks ENETC_PORT Register Masks
 * @{
 */

