zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PORT.h
/*! @name PCAPR - Port capability register */
/*! @{ */

#define ENETC_PORT_PCAPR_LINK_TYPE_MASK          (0x10U)
#define ENETC_PORT_PCAPR_LINK_TYPE_SHIFT         (4U)
#define ENETC_PORT_PCAPR_LINK_TYPE_WIDTH         (1U)
#define ENETC_PORT_PCAPR_LINK_TYPE(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PCAPR_LINK_TYPE_SHIFT)) & ENETC_PORT_PCAPR_LINK_TYPE_MASK)

#define ENETC_PORT_PCAPR_NUM_TC_MASK             (0xF000U)
#define ENETC_PORT_PCAPR_NUM_TC_SHIFT            (12U)
#define ENETC_PORT_PCAPR_NUM_TC_WIDTH            (4U)
#define ENETC_PORT_PCAPR_NUM_TC(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PCAPR_NUM_TC_SHIFT)) & ENETC_PORT_PCAPR_NUM_TC_MASK)

#define ENETC_PORT_PCAPR_NUM_Q_MASK              (0xF0000U)
#define ENETC_PORT_PCAPR_NUM_Q_SHIFT             (16U)
#define ENETC_PORT_PCAPR_NUM_Q_WIDTH             (4U)
#define ENETC_PORT_PCAPR_NUM_Q(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PCAPR_NUM_Q_SHIFT)) & ENETC_PORT_PCAPR_NUM_Q_MASK)

#define ENETC_PORT_PCAPR_NUM_CBS_MASK            (0x700000U)
#define ENETC_PORT_PCAPR_NUM_CBS_SHIFT           (20U)
#define ENETC_PORT_PCAPR_NUM_CBS_WIDTH           (3U)
#define ENETC_PORT_PCAPR_NUM_CBS(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PCAPR_NUM_CBS_SHIFT)) & ENETC_PORT_PCAPR_NUM_CBS_MASK)

#define ENETC_PORT_PCAPR_NUM_CG_MASK             (0xF000000U)
#define ENETC_PORT_PCAPR_NUM_CG_SHIFT            (24U)
#define ENETC_PORT_PCAPR_NUM_CG_WIDTH            (4U)
#define ENETC_PORT_PCAPR_NUM_CG(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PCAPR_NUM_CG_SHIFT)) & ENETC_PORT_PCAPR_NUM_CG_MASK)

#define ENETC_PORT_PCAPR_TGS_MASK                (0x10000000U)
#define ENETC_PORT_PCAPR_TGS_SHIFT               (28U)
#define ENETC_PORT_PCAPR_TGS_WIDTH               (1U)
#define ENETC_PORT_PCAPR_TGS(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PCAPR_TGS_SHIFT)) & ENETC_PORT_PCAPR_TGS_MASK)

#define ENETC_PORT_PCAPR_CBS_MASK                (0x20000000U)
#define ENETC_PORT_PCAPR_CBS_SHIFT               (29U)
#define ENETC_PORT_PCAPR_CBS_WIDTH               (1U)
#define ENETC_PORT_PCAPR_CBS(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PCAPR_CBS_SHIFT)) & ENETC_PORT_PCAPR_CBS_MASK)

#define ENETC_PORT_PCAPR_ECBS_MASK               (0x40000000U)
#define ENETC_PORT_PCAPR_ECBS_SHIFT              (30U)
#define ENETC_PORT_PCAPR_ECBS_WIDTH              (1U)
#define ENETC_PORT_PCAPR_ECBS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PCAPR_ECBS_SHIFT)) & ENETC_PORT_PCAPR_ECBS_MASK)

#define ENETC_PORT_PCAPR_ATS_MASK                (0x80000000U)
#define ENETC_PORT_PCAPR_ATS_SHIFT               (31U)
#define ENETC_PORT_PCAPR_ATS_WIDTH               (1U)
#define ENETC_PORT_PCAPR_ATS(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PCAPR_ATS_SHIFT)) & ENETC_PORT_PCAPR_ATS_MASK)
/*! @} */

/*! @name PMCAPR - Port MAC capability register */
/*! @{ */

#define ENETC_PORT_PMCAPR_MAC_VAR_MASK           (0x7U)
#define ENETC_PORT_PMCAPR_MAC_VAR_SHIFT          (0U)
#define ENETC_PORT_PMCAPR_MAC_VAR_WIDTH          (3U)
#define ENETC_PORT_PMCAPR_MAC_VAR(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PMCAPR_MAC_VAR_SHIFT)) & ENETC_PORT_PMCAPR_MAC_VAR_MASK)

#define ENETC_PORT_PMCAPR_EFPAD_MASK             (0x30U)
#define ENETC_PORT_PMCAPR_EFPAD_SHIFT            (4U)
#define ENETC_PORT_PMCAPR_EFPAD_WIDTH            (2U)
#define ENETC_PORT_PMCAPR_EFPAD(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PMCAPR_EFPAD_SHIFT)) & ENETC_PORT_PMCAPR_EFPAD_MASK)

#define ENETC_PORT_PMCAPR_PIPG_MASK              (0x40U)
#define ENETC_PORT_PMCAPR_PIPG_SHIFT             (6U)
#define ENETC_PORT_PMCAPR_PIPG_WIDTH             (1U)
#define ENETC_PORT_PMCAPR_PIPG(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PMCAPR_PIPG_SHIFT)) & ENETC_PORT_PMCAPR_PIPG_MASK)

#define ENETC_PORT_PMCAPR_HD_MASK                (0x100U)
#define ENETC_PORT_PMCAPR_HD_SHIFT               (8U)
#define ENETC_PORT_PMCAPR_HD_WIDTH               (1U)
#define ENETC_PORT_PMCAPR_HD(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PMCAPR_HD_SHIFT)) & ENETC_PORT_PMCAPR_HD_MASK)

#define ENETC_PORT_PMCAPR_FP_MASK                (0x600U)
#define ENETC_PORT_PMCAPR_FP_SHIFT               (9U)
#define ENETC_PORT_PMCAPR_FP_WIDTH               (2U)
#define ENETC_PORT_PMCAPR_FP(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PMCAPR_FP_SHIFT)) & ENETC_PORT_PMCAPR_FP_MASK)

#define ENETC_PORT_PMCAPR_MIN_MPDU_MASK          (0x1000U)
#define ENETC_PORT_PMCAPR_MIN_MPDU_SHIFT         (12U)
#define ENETC_PORT_PMCAPR_MIN_MPDU_WIDTH         (1U)
#define ENETC_PORT_PMCAPR_MIN_MPDU(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PMCAPR_MIN_MPDU_SHIFT)) & ENETC_PORT_PMCAPR_MIN_MPDU_MASK)

#define ENETC_PORT_PMCAPR_MSEC_MASK              (0x2000U)
#define ENETC_PORT_PMCAPR_MSEC_SHIFT             (13U)
#define ENETC_PORT_PMCAPR_MSEC_WIDTH             (1U)
#define ENETC_PORT_PMCAPR_MSEC(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PMCAPR_MSEC_SHIFT)) & ENETC_PORT_PMCAPR_MSEC_MASK)

#define ENETC_PORT_PMCAPR_RGMII_DLY_MODE_CAP_MASK (0x300000U)
#define ENETC_PORT_PMCAPR_RGMII_DLY_MODE_CAP_SHIFT (20U)
#define ENETC_PORT_PMCAPR_RGMII_DLY_MODE_CAP_WIDTH (2U)
#define ENETC_PORT_PMCAPR_RGMII_DLY_MODE_CAP(x)  (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PMCAPR_RGMII_DLY_MODE_CAP_SHIFT)) & ENETC_PORT_PMCAPR_RGMII_DLY_MODE_CAP_MASK)

#define ENETC_PORT_PMCAPR_MII_PROT_MASK          (0xF000000U)
#define ENETC_PORT_PMCAPR_MII_PROT_SHIFT         (24U)
#define ENETC_PORT_PMCAPR_MII_PROT_WIDTH         (4U)
#define ENETC_PORT_PMCAPR_MII_PROT(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PMCAPR_MII_PROT_SHIFT)) & ENETC_PORT_PMCAPR_MII_PROT_MASK)
/*! @} */

/*! @name PIOCAPR - Port I/O capability register */
/*! @{ */

#define ENETC_PORT_PIOCAPR_PCS_PROT_MASK         (0xFFFFU)
#define ENETC_PORT_PIOCAPR_PCS_PROT_SHIFT        (0U)
#define ENETC_PORT_PIOCAPR_PCS_PROT_WIDTH        (16U)
#define ENETC_PORT_PIOCAPR_PCS_PROT(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PIOCAPR_PCS_PROT_SHIFT)) & ENETC_PORT_PIOCAPR_PCS_PROT_MASK)

#define ENETC_PORT_PIOCAPR_IO_VAR_MASK           (0xF000000U)
#define ENETC_PORT_PIOCAPR_IO_VAR_SHIFT          (24U)
#define ENETC_PORT_PIOCAPR_IO_VAR_WIDTH          (4U)
#define ENETC_PORT_PIOCAPR_IO_VAR(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PIOCAPR_IO_VAR_SHIFT)) & ENETC_PORT_PIOCAPR_IO_VAR_MASK)

#define ENETC_PORT_PIOCAPR_EMDIO_MASK            (0x10000000U)
#define ENETC_PORT_PIOCAPR_EMDIO_SHIFT           (28U)
#define ENETC_PORT_PIOCAPR_EMDIO_WIDTH           (1U)
#define ENETC_PORT_PIOCAPR_EMDIO(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PIOCAPR_EMDIO_SHIFT)) & ENETC_PORT_PIOCAPR_EMDIO_MASK)

#define ENETC_PORT_PIOCAPR_REVMII_RATE_MASK      (0x40000000U)
#define ENETC_PORT_PIOCAPR_REVMII_RATE_SHIFT     (30U)
#define ENETC_PORT_PIOCAPR_REVMII_RATE_WIDTH     (1U)
#define ENETC_PORT_PIOCAPR_REVMII_RATE(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PIOCAPR_REVMII_RATE_SHIFT)) & ENETC_PORT_PIOCAPR_REVMII_RATE_MASK)

#define ENETC_PORT_PIOCAPR_REVMII_MASK           (0x80000000U)
#define ENETC_PORT_PIOCAPR_REVMII_SHIFT          (31U)
#define ENETC_PORT_PIOCAPR_REVMII_WIDTH          (1U)
#define ENETC_PORT_PIOCAPR_REVMII(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PIOCAPR_REVMII_SHIFT)) & ENETC_PORT_PIOCAPR_REVMII_MASK)
/*! @} */

/*! @name PCR - Port configuration register */
/*! @{ */

#define ENETC_PORT_PCR_HDR_FMT_MASK              (0x1U)
#define ENETC_PORT_PCR_HDR_FMT_SHIFT             (0U)
#define ENETC_PORT_PCR_HDR_FMT_WIDTH             (1U)
#define ENETC_PORT_PCR_HDR_FMT(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PCR_HDR_FMT_SHIFT)) & ENETC_PORT_PCR_HDR_FMT_MASK)

#define ENETC_PORT_PCR_NS_TAG_PORT_MASK          (0x8U)
#define ENETC_PORT_PCR_NS_TAG_PORT_SHIFT         (3U)
#define ENETC_PORT_PCR_NS_TAG_PORT_WIDTH         (1U)
#define ENETC_PORT_PCR_NS_TAG_PORT(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PCR_NS_TAG_PORT_SHIFT)) & ENETC_PORT_PCR_NS_TAG_PORT_MASK)

#define ENETC_PORT_PCR_L2DOSE_MASK               (0x10U)
#define ENETC_PORT_PCR_L2DOSE_SHIFT              (4U)
#define ENETC_PORT_PCR_L2DOSE_WIDTH              (1U)
#define ENETC_PORT_PCR_L2DOSE(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PCR_L2DOSE_SHIFT)) & ENETC_PORT_PCR_L2DOSE_MASK)

#define ENETC_PORT_PCR_L3DOSE_MASK               (0x20U)
#define ENETC_PORT_PCR_L3DOSE_SHIFT              (5U)
#define ENETC_PORT_PCR_L3DOSE_WIDTH              (1U)
#define ENETC_PORT_PCR_L3DOSE(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PCR_L3DOSE_SHIFT)) & ENETC_PORT_PCR_L3DOSE_MASK)

