zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PORT.h
#define ENETC_PORT_PCR_TIMER_CS_MASK             (0x100U)
#define ENETC_PORT_PCR_TIMER_CS_SHIFT            (8U)
#define ENETC_PORT_PCR_TIMER_CS_WIDTH            (1U)
#define ENETC_PORT_PCR_TIMER_CS(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PCR_TIMER_CS_SHIFT)) & ENETC_PORT_PCR_TIMER_CS_MASK)

#define ENETC_PORT_PCR_FCSEA_MASK                (0x1000U)
#define ENETC_PORT_PCR_FCSEA_SHIFT               (12U)
#define ENETC_PORT_PCR_FCSEA_WIDTH               (1U)
#define ENETC_PORT_PCR_FCSEA(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PCR_FCSEA_SHIFT)) & ENETC_PORT_PCR_FCSEA_MASK)

#define ENETC_PORT_PCR_PSPEED_MASK               (0x3FFF0000U)
#define ENETC_PORT_PCR_PSPEED_SHIFT              (16U)
#define ENETC_PORT_PCR_PSPEED_WIDTH              (14U)
#define ENETC_PORT_PCR_PSPEED(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PCR_PSPEED_SHIFT)) & ENETC_PORT_PCR_PSPEED_MASK)
/*! @} */

/*! @name PMAR0 - Port MAC address register 0 */
/*! @{ */

#define ENETC_PORT_PMAR0_PRIM_MAC_ADDR_MASK      (0xFFFFFFFFU)
#define ENETC_PORT_PMAR0_PRIM_MAC_ADDR_SHIFT     (0U)
#define ENETC_PORT_PMAR0_PRIM_MAC_ADDR_WIDTH     (32U)
#define ENETC_PORT_PMAR0_PRIM_MAC_ADDR(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PMAR0_PRIM_MAC_ADDR_SHIFT)) & ENETC_PORT_PMAR0_PRIM_MAC_ADDR_MASK)
/*! @} */

/*! @name PMAR1 - Port MAC address register 1 */
/*! @{ */

#define ENETC_PORT_PMAR1_PRIM_MAC_ADDR_MASK      (0xFFFFU)
#define ENETC_PORT_PMAR1_PRIM_MAC_ADDR_SHIFT     (0U)
#define ENETC_PORT_PMAR1_PRIM_MAC_ADDR_WIDTH     (16U)
#define ENETC_PORT_PMAR1_PRIM_MAC_ADDR(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PMAR1_PRIM_MAC_ADDR_SHIFT)) & ENETC_PORT_PMAR1_PRIM_MAC_ADDR_MASK)
/*! @} */

/*! @name PTAR - Port TPID acceptance register */
/*! @{ */

#define ENETC_PORT_PTAR_OVTPIDL_MASK             (0xFU)
#define ENETC_PORT_PTAR_OVTPIDL_SHIFT            (0U)
#define ENETC_PORT_PTAR_OVTPIDL_WIDTH            (4U)
#define ENETC_PORT_PTAR_OVTPIDL(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTAR_OVTPIDL_SHIFT)) & ENETC_PORT_PTAR_OVTPIDL_MASK)

#define ENETC_PORT_PTAR_IVTPIDL_MASK             (0xF0U)
#define ENETC_PORT_PTAR_IVTPIDL_SHIFT            (4U)
#define ENETC_PORT_PTAR_IVTPIDL_WIDTH            (4U)
#define ENETC_PORT_PTAR_IVTPIDL(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTAR_IVTPIDL_SHIFT)) & ENETC_PORT_PTAR_IVTPIDL_MASK)
/*! @} */

/*! @name PQOSMR - Port QoS mode register */
/*! @{ */

#define ENETC_PORT_PQOSMR_VS_MASK                (0x1U)
#define ENETC_PORT_PQOSMR_VS_SHIFT               (0U)
#define ENETC_PORT_PQOSMR_VS_WIDTH               (1U)
#define ENETC_PORT_PQOSMR_VS(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PQOSMR_VS_SHIFT)) & ENETC_PORT_PQOSMR_VS_MASK)

#define ENETC_PORT_PQOSMR_VE_MASK                (0x2U)
#define ENETC_PORT_PQOSMR_VE_SHIFT               (1U)
#define ENETC_PORT_PQOSMR_VE_WIDTH               (1U)
#define ENETC_PORT_PQOSMR_VE(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PQOSMR_VE_SHIFT)) & ENETC_PORT_PQOSMR_VE_MASK)

#define ENETC_PORT_PQOSMR_DDR_MASK               (0xCU)
#define ENETC_PORT_PQOSMR_DDR_SHIFT              (2U)
#define ENETC_PORT_PQOSMR_DDR_WIDTH              (2U)
#define ENETC_PORT_PQOSMR_DDR(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PQOSMR_DDR_SHIFT)) & ENETC_PORT_PQOSMR_DDR_MASK)

#define ENETC_PORT_PQOSMR_DIPV_MASK              (0x70U)
#define ENETC_PORT_PQOSMR_DIPV_SHIFT             (4U)
#define ENETC_PORT_PQOSMR_DIPV_WIDTH             (3U)
#define ENETC_PORT_PQOSMR_DIPV(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PQOSMR_DIPV_SHIFT)) & ENETC_PORT_PQOSMR_DIPV_MASK)

#define ENETC_PORT_PQOSMR_VQMP_MASK              (0xF0000U)
#define ENETC_PORT_PQOSMR_VQMP_SHIFT             (16U)
#define ENETC_PORT_PQOSMR_VQMP_WIDTH             (4U)
#define ENETC_PORT_PQOSMR_VQMP(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PQOSMR_VQMP_SHIFT)) & ENETC_PORT_PQOSMR_VQMP_MASK)
/*! @} */

/*! @name PPCR - Port parser configuration register */
/*! @{ */

#define ENETC_PORT_PPCR_L1PFS_MASK               (0x3EU)
#define ENETC_PORT_PPCR_L1PFS_SHIFT              (1U)
#define ENETC_PORT_PPCR_L1PFS_WIDTH              (5U)
#define ENETC_PORT_PPCR_L1PFS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PPCR_L1PFS_SHIFT)) & ENETC_PORT_PPCR_L1PFS_MASK)

#define ENETC_PORT_PPCR_L2PFS_MASK               (0x3E00U)
#define ENETC_PORT_PPCR_L2PFS_SHIFT              (9U)
#define ENETC_PORT_PPCR_L2PFS_WIDTH              (5U)
#define ENETC_PORT_PPCR_L2PFS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PPCR_L2PFS_SHIFT)) & ENETC_PORT_PPCR_L2PFS_MASK)

#define ENETC_PORT_PPCR_L3HFP_MASK               (0x10000U)
#define ENETC_PORT_PPCR_L3HFP_SHIFT              (16U)
#define ENETC_PORT_PPCR_L3HFP_WIDTH              (1U)
#define ENETC_PORT_PPCR_L3HFP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PPCR_L3HFP_SHIFT)) & ENETC_PORT_PPCR_L3HFP_MASK)

#define ENETC_PORT_PPCR_L3PFS_MASK               (0x3E0000U)
#define ENETC_PORT_PPCR_L3PFS_SHIFT              (17U)
#define ENETC_PORT_PPCR_L3PFS_WIDTH              (5U)
#define ENETC_PORT_PPCR_L3PFS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PPCR_L3PFS_SHIFT)) & ENETC_PORT_PPCR_L3PFS_MASK)

#define ENETC_PORT_PPCR_L4HFP_MASK               (0x1000000U)
#define ENETC_PORT_PPCR_L4HFP_SHIFT              (24U)
#define ENETC_PORT_PPCR_L4HFP_WIDTH              (1U)
#define ENETC_PORT_PPCR_L4HFP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PPCR_L4HFP_SHIFT)) & ENETC_PORT_PPCR_L4HFP_MASK)

#define ENETC_PORT_PPCR_L4PFS_MASK               (0x3E000000U)
#define ENETC_PORT_PPCR_L4PFS_SHIFT              (25U)
#define ENETC_PORT_PPCR_L4PFS_WIDTH              (5U)
#define ENETC_PORT_PPCR_L4PFS(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PPCR_L4PFS_SHIFT)) & ENETC_PORT_PPCR_L4PFS_MASK)
/*! @} */

/*! @name PIPFCR - Port ingress port filter configuration register */
/*! @{ */

