zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PORT.h
#define ENETC_PORT_PIPFCR_EN_MASK                (0x1U)
#define ENETC_PORT_PIPFCR_EN_SHIFT               (0U)
#define ENETC_PORT_PIPFCR_EN_WIDTH               (1U)
#define ENETC_PORT_PIPFCR_EN(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PIPFCR_EN_SHIFT)) & ENETC_PORT_PIPFCR_EN_MASK)
/*! @} */

/*! @name PSGCR - Port stream gate configuration register */
/*! @{ */

#define ENETC_PORT_PSGCR_PDELAY_MASK             (0xFFFFFFU)
#define ENETC_PORT_PSGCR_PDELAY_SHIFT            (0U)
#define ENETC_PORT_PSGCR_PDELAY_WIDTH            (24U)
#define ENETC_PORT_PSGCR_PDELAY(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PSGCR_PDELAY_SHIFT)) & ENETC_PORT_PSGCR_PDELAY_MASK)

#define ENETC_PORT_PSGCR_OGC_MASK                (0x80000000U)
#define ENETC_PORT_PSGCR_OGC_SHIFT               (31U)
#define ENETC_PORT_PSGCR_OGC_WIDTH               (1U)
#define ENETC_PORT_PSGCR_OGC(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PSGCR_OGC_SHIFT)) & ENETC_PORT_PSGCR_OGC_MASK)
/*! @} */

/*! @name POR - Port operational register */
/*! @{ */

#define ENETC_PORT_POR_TXDIS_MASK                (0x1U)
#define ENETC_PORT_POR_TXDIS_SHIFT               (0U)
#define ENETC_PORT_POR_TXDIS_WIDTH               (1U)
#define ENETC_PORT_POR_TXDIS(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_POR_TXDIS_SHIFT)) & ENETC_PORT_POR_TXDIS_MASK)

#define ENETC_PORT_POR_RXDIS_MASK                (0x2U)
#define ENETC_PORT_POR_RXDIS_SHIFT               (1U)
#define ENETC_PORT_POR_RXDIS_WIDTH               (1U)
#define ENETC_PORT_POR_RXDIS(x)                  (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_POR_RXDIS_SHIFT)) & ENETC_PORT_POR_RXDIS_MASK)
/*! @} */

/*! @name PSR - Port status register */
/*! @{ */

#define ENETC_PORT_PSR_TX_BUSY_MASK              (0x1U)
#define ENETC_PORT_PSR_TX_BUSY_SHIFT             (0U)
#define ENETC_PORT_PSR_TX_BUSY_WIDTH             (1U)
#define ENETC_PORT_PSR_TX_BUSY(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PSR_TX_BUSY_SHIFT)) & ENETC_PORT_PSR_TX_BUSY_MASK)

#define ENETC_PORT_PSR_RX_BUSY_MASK              (0x2U)
#define ENETC_PORT_PSR_RX_BUSY_SHIFT             (1U)
#define ENETC_PORT_PSR_RX_BUSY_WIDTH             (1U)
#define ENETC_PORT_PSR_RX_BUSY(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PSR_RX_BUSY_SHIFT)) & ENETC_PORT_PSR_RX_BUSY_MASK)
/*! @} */

/*! @name PRXSDUOR - Port receive SDU overhead register */
/*! @{ */

#define ENETC_PORT_PRXSDUOR_PPDU_BCO_MASK        (0x1FU)
#define ENETC_PORT_PRXSDUOR_PPDU_BCO_SHIFT       (0U)
#define ENETC_PORT_PRXSDUOR_PPDU_BCO_WIDTH       (5U)
#define ENETC_PORT_PRXSDUOR_PPDU_BCO(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXSDUOR_PPDU_BCO_SHIFT)) & ENETC_PORT_PRXSDUOR_PPDU_BCO_MASK)

#define ENETC_PORT_PRXSDUOR_MACSEC_BCO_MASK      (0x3F00U)
#define ENETC_PORT_PRXSDUOR_MACSEC_BCO_SHIFT     (8U)
#define ENETC_PORT_PRXSDUOR_MACSEC_BCO_WIDTH     (6U)
#define ENETC_PORT_PRXSDUOR_MACSEC_BCO(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXSDUOR_MACSEC_BCO_SHIFT)) & ENETC_PORT_PRXSDUOR_MACSEC_BCO_MASK)
/*! @} */

/*! @name PTXSDUOR - Port transmit SDU overhead register */
/*! @{ */

#define ENETC_PORT_PTXSDUOR_PPDU_BCO_MASK        (0x1FU)
#define ENETC_PORT_PTXSDUOR_PPDU_BCO_SHIFT       (0U)
#define ENETC_PORT_PTXSDUOR_PPDU_BCO_WIDTH       (5U)
#define ENETC_PORT_PTXSDUOR_PPDU_BCO(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTXSDUOR_PPDU_BCO_SHIFT)) & ENETC_PORT_PTXSDUOR_PPDU_BCO_MASK)

#define ENETC_PORT_PTXSDUOR_MACSEC_BCO_MASK      (0x3F00U)
#define ENETC_PORT_PTXSDUOR_MACSEC_BCO_SHIFT     (8U)
#define ENETC_PORT_PTXSDUOR_MACSEC_BCO_WIDTH     (6U)
#define ENETC_PORT_PTXSDUOR_MACSEC_BCO(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTXSDUOR_MACSEC_BCO_SHIFT)) & ENETC_PORT_PTXSDUOR_MACSEC_BCO_MASK)
/*! @} */

/*! @name PTGSCR - Port time gate scheduling control register */
/*! @{ */

#define ENETC_PORT_PTGSCR_TGE_MASK               (0x80000000U)
#define ENETC_PORT_PTGSCR_TGE_SHIFT              (31U)
#define ENETC_PORT_PTGSCR_TGE_WIDTH              (1U)
#define ENETC_PORT_PTGSCR_TGE(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTGSCR_TGE_SHIFT)) & ENETC_PORT_PTGSCR_TGE_MASK)
/*! @} */

/*! @name PTGAGLSR - Port time gate scheduling admin gate list status register */
/*! @{ */

#define ENETC_PORT_PTGAGLSR_TG_MASK              (0x1U)
#define ENETC_PORT_PTGAGLSR_TG_SHIFT             (0U)
#define ENETC_PORT_PTGAGLSR_TG_WIDTH             (1U)
#define ENETC_PORT_PTGAGLSR_TG(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTGAGLSR_TG_SHIFT)) & ENETC_PORT_PTGAGLSR_TG_MASK)

#define ENETC_PORT_PTGAGLSR_CFG_PEND_MASK        (0x2U)
#define ENETC_PORT_PTGAGLSR_CFG_PEND_SHIFT       (1U)
#define ENETC_PORT_PTGAGLSR_CFG_PEND_WIDTH       (1U)
#define ENETC_PORT_PTGAGLSR_CFG_PEND(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTGAGLSR_CFG_PEND_SHIFT)) & ENETC_PORT_PTGAGLSR_CFG_PEND_MASK)
/*! @} */

/*! @name PTGAGLLR - Port time gate scheduling admin gate list length register */
/*! @{ */

#define ENETC_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH_MASK (0xFFFFU)
#define ENETC_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH_SHIFT (0U)
#define ENETC_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH_WIDTH (16U)
#define ENETC_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH_SHIFT)) & ENETC_PORT_PTGAGLLR_ADMIN_GATE_LIST_LENGTH_MASK)
/*! @} */

/*! @name PTGOGLLR - Port time gating operational gate list length register */
/*! @{ */

#define ENETC_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH_MASK (0xFFFFU)
#define ENETC_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH_SHIFT (0U)
#define ENETC_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH_WIDTH (16U)
#define ENETC_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH_SHIFT)) & ENETC_PORT_PTGOGLLR_OPER_GATE_LIST_LENGTH_MASK)
/*! @} */

/*! @name PTGSATOR - Port time gate scheduling advance time offset register */
/*! @{ */

#define ENETC_PORT_PTGSATOR_ADV_TIME_OFFSET_MASK (0xFFFFU)
#define ENETC_PORT_PTGSATOR_ADV_TIME_OFFSET_SHIFT (0U)
#define ENETC_PORT_PTGSATOR_ADV_TIME_OFFSET_WIDTH (16U)
#define ENETC_PORT_PTGSATOR_ADV_TIME_OFFSET(x)   (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTGSATOR_ADV_TIME_OFFSET_SHIFT)) & ENETC_PORT_PTGSATOR_ADV_TIME_OFFSET_MASK)
/*! @} */

/*! @name PDGSR - Port default gate state register */
/*! @{ */

