zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PORT.h
#define ENETC_PORT_PDGSR_DGS_TC0_MASK            (0x1U)
#define ENETC_PORT_PDGSR_DGS_TC0_SHIFT           (0U)
#define ENETC_PORT_PDGSR_DGS_TC0_WIDTH           (1U)
#define ENETC_PORT_PDGSR_DGS_TC0(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PDGSR_DGS_TC0_SHIFT)) & ENETC_PORT_PDGSR_DGS_TC0_MASK)

#define ENETC_PORT_PDGSR_DGS_TC1_MASK            (0x2U)
#define ENETC_PORT_PDGSR_DGS_TC1_SHIFT           (1U)
#define ENETC_PORT_PDGSR_DGS_TC1_WIDTH           (1U)
#define ENETC_PORT_PDGSR_DGS_TC1(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PDGSR_DGS_TC1_SHIFT)) & ENETC_PORT_PDGSR_DGS_TC1_MASK)

#define ENETC_PORT_PDGSR_DGS_TC2_MASK            (0x4U)
#define ENETC_PORT_PDGSR_DGS_TC2_SHIFT           (2U)
#define ENETC_PORT_PDGSR_DGS_TC2_WIDTH           (1U)
#define ENETC_PORT_PDGSR_DGS_TC2(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PDGSR_DGS_TC2_SHIFT)) & ENETC_PORT_PDGSR_DGS_TC2_MASK)

#define ENETC_PORT_PDGSR_DGS_TC3_MASK            (0x8U)
#define ENETC_PORT_PDGSR_DGS_TC3_SHIFT           (3U)
#define ENETC_PORT_PDGSR_DGS_TC3_WIDTH           (1U)
#define ENETC_PORT_PDGSR_DGS_TC3(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PDGSR_DGS_TC3_SHIFT)) & ENETC_PORT_PDGSR_DGS_TC3_MASK)

#define ENETC_PORT_PDGSR_DGS_TC4_MASK            (0x10U)
#define ENETC_PORT_PDGSR_DGS_TC4_SHIFT           (4U)
#define ENETC_PORT_PDGSR_DGS_TC4_WIDTH           (1U)
#define ENETC_PORT_PDGSR_DGS_TC4(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PDGSR_DGS_TC4_SHIFT)) & ENETC_PORT_PDGSR_DGS_TC4_MASK)

#define ENETC_PORT_PDGSR_DGS_TC5_MASK            (0x20U)
#define ENETC_PORT_PDGSR_DGS_TC5_SHIFT           (5U)
#define ENETC_PORT_PDGSR_DGS_TC5_WIDTH           (1U)
#define ENETC_PORT_PDGSR_DGS_TC5(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PDGSR_DGS_TC5_SHIFT)) & ENETC_PORT_PDGSR_DGS_TC5_MASK)

#define ENETC_PORT_PDGSR_DGS_TC6_MASK            (0x40U)
#define ENETC_PORT_PDGSR_DGS_TC6_SHIFT           (6U)
#define ENETC_PORT_PDGSR_DGS_TC6_WIDTH           (1U)
#define ENETC_PORT_PDGSR_DGS_TC6(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PDGSR_DGS_TC6_SHIFT)) & ENETC_PORT_PDGSR_DGS_TC6_MASK)

#define ENETC_PORT_PDGSR_DGS_TC7_MASK            (0x80U)
#define ENETC_PORT_PDGSR_DGS_TC7_SHIFT           (7U)
#define ENETC_PORT_PDGSR_DGS_TC7_WIDTH           (1U)
#define ENETC_PORT_PDGSR_DGS_TC7(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PDGSR_DGS_TC7_SHIFT)) & ENETC_PORT_PDGSR_DGS_TC7_MASK)
/*! @} */

/*! @name PRXDCR - Port Rx discard count register */
/*! @{ */

#define ENETC_PORT_PRXDCR_COUNT_MASK             (0xFFFFFFFFU)
#define ENETC_PORT_PRXDCR_COUNT_SHIFT            (0U)
#define ENETC_PORT_PRXDCR_COUNT_WIDTH            (32U)
#define ENETC_PORT_PRXDCR_COUNT(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCR_COUNT_SHIFT)) & ENETC_PORT_PRXDCR_COUNT_MASK)
/*! @} */

/*! @name PRXDCRR0 - Port Rx discard count reason register 0 */
/*! @{ */

#define ENETC_PORT_PRXDCRR0_PCDR_MASK            (0x1U)
#define ENETC_PORT_PRXDCRR0_PCDR_SHIFT           (0U)
#define ENETC_PORT_PRXDCRR0_PCDR_WIDTH           (1U)
#define ENETC_PORT_PRXDCRR0_PCDR(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_PCDR_SHIFT)) & ENETC_PORT_PRXDCRR0_PCDR_MASK)

#define ENETC_PORT_PRXDCRR0_SMREDR_MASK          (0x2U)
#define ENETC_PORT_PRXDCRR0_SMREDR_SHIFT         (1U)
#define ENETC_PORT_PRXDCRR0_SMREDR_WIDTH         (1U)
#define ENETC_PORT_PRXDCRR0_SMREDR(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_SMREDR_SHIFT)) & ENETC_PORT_PRXDCRR0_SMREDR_MASK)

#define ENETC_PORT_PRXDCRR0_RXDISDR_MASK         (0x4U)
#define ENETC_PORT_PRXDCRR0_RXDISDR_SHIFT        (2U)
#define ENETC_PORT_PRXDCRR0_RXDISDR_WIDTH        (1U)
#define ENETC_PORT_PRXDCRR0_RXDISDR(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_RXDISDR_SHIFT)) & ENETC_PORT_PRXDCRR0_RXDISDR_MASK)

#define ENETC_PORT_PRXDCRR0_IPFDR_MASK           (0x8U)
#define ENETC_PORT_PRXDCRR0_IPFDR_SHIFT          (3U)
#define ENETC_PORT_PRXDCRR0_IPFDR_WIDTH          (1U)
#define ENETC_PORT_PRXDCRR0_IPFDR(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_IPFDR_SHIFT)) & ENETC_PORT_PRXDCRR0_IPFDR_MASK)

#define ENETC_PORT_PRXDCRR0_RPDR_MASK            (0x10U)
#define ENETC_PORT_PRXDCRR0_RPDR_SHIFT           (4U)
#define ENETC_PORT_PRXDCRR0_RPDR_WIDTH           (1U)
#define ENETC_PORT_PRXDCRR0_RPDR(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_RPDR_SHIFT)) & ENETC_PORT_PRXDCRR0_RPDR_MASK)

#define ENETC_PORT_PRXDCRR0_ISFDR_MASK           (0x20U)
#define ENETC_PORT_PRXDCRR0_ISFDR_SHIFT          (5U)
#define ENETC_PORT_PRXDCRR0_ISFDR_WIDTH          (1U)
#define ENETC_PORT_PRXDCRR0_ISFDR(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_ISFDR_SHIFT)) & ENETC_PORT_PRXDCRR0_ISFDR_MASK)

#define ENETC_PORT_PRXDCRR0_SGCDR_MASK           (0x40U)
#define ENETC_PORT_PRXDCRR0_SGCDR_SHIFT          (6U)
#define ENETC_PORT_PRXDCRR0_SGCDR_WIDTH          (1U)
#define ENETC_PORT_PRXDCRR0_SGCDR(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_SGCDR_SHIFT)) & ENETC_PORT_PRXDCRR0_SGCDR_MASK)

#define ENETC_PORT_PRXDCRR0_SGOEDR_MASK          (0x80U)
#define ENETC_PORT_PRXDCRR0_SGOEDR_SHIFT         (7U)
#define ENETC_PORT_PRXDCRR0_SGOEDR_WIDTH         (1U)
#define ENETC_PORT_PRXDCRR0_SGOEDR(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_SGOEDR_SHIFT)) & ENETC_PORT_PRXDCRR0_SGOEDR_MASK)

#define ENETC_PORT_PRXDCRR0_MSDUEDR_MASK         (0x100U)
#define ENETC_PORT_PRXDCRR0_MSDUEDR_SHIFT        (8U)
#define ENETC_PORT_PRXDCRR0_MSDUEDR_WIDTH        (1U)
#define ENETC_PORT_PRXDCRR0_MSDUEDR(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_MSDUEDR_SHIFT)) & ENETC_PORT_PRXDCRR0_MSDUEDR_MASK)

#define ENETC_PORT_PRXDCRR0_ITEDR_MASK           (0x800U)
#define ENETC_PORT_PRXDCRR0_ITEDR_SHIFT          (11U)
#define ENETC_PORT_PRXDCRR0_ITEDR_WIDTH          (1U)
#define ENETC_PORT_PRXDCRR0_ITEDR(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_ITEDR_SHIFT)) & ENETC_PORT_PRXDCRR0_ITEDR_MASK)

#define ENETC_PORT_PRXDCRR0_ECCEDR_MASK          (0x1000U)
#define ENETC_PORT_PRXDCRR0_ECCEDR_SHIFT         (12U)
#define ENETC_PORT_PRXDCRR0_ECCEDR_WIDTH         (1U)
#define ENETC_PORT_PRXDCRR0_ECCEDR(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_ECCEDR_SHIFT)) & ENETC_PORT_PRXDCRR0_ECCEDR_MASK)

#define ENETC_PORT_PRXDCRR0_SIFDR_MASK           (0x2000U)
#define ENETC_PORT_PRXDCRR0_SIFDR_SHIFT          (13U)
#define ENETC_PORT_PRXDCRR0_SIFDR_WIDTH          (1U)
#define ENETC_PORT_PRXDCRR0_SIFDR(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_SIFDR_SHIFT)) & ENETC_PORT_PRXDCRR0_SIFDR_MASK)

#define ENETC_PORT_PRXDCRR0_L2DOSDR_MASK         (0x4000U)
#define ENETC_PORT_PRXDCRR0_L2DOSDR_SHIFT        (14U)
#define ENETC_PORT_PRXDCRR0_L2DOSDR_WIDTH        (1U)
#define ENETC_PORT_PRXDCRR0_L2DOSDR(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_L2DOSDR_SHIFT)) & ENETC_PORT_PRXDCRR0_L2DOSDR_MASK)

#define ENETC_PORT_PRXDCRR0_L3DOSDR_MASK         (0x8000U)
#define ENETC_PORT_PRXDCRR0_L3DOSDR_SHIFT        (15U)
#define ENETC_PORT_PRXDCRR0_L3DOSDR_WIDTH        (1U)
#define ENETC_PORT_PRXDCRR0_L3DOSDR(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_L3DOSDR_SHIFT)) & ENETC_PORT_PRXDCRR0_L3DOSDR_MASK)

