zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PORT.h
#define ENETC_PORT_PRXDCRR0_PEDR_MASK            (0x10000U)
#define ENETC_PORT_PRXDCRR0_PEDR_SHIFT           (16U)
#define ENETC_PORT_PRXDCRR0_PEDR_WIDTH           (1U)
#define ENETC_PORT_PRXDCRR0_PEDR(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_PEDR_SHIFT)) & ENETC_PORT_PRXDCRR0_PEDR_MASK)

#define ENETC_PORT_PRXDCRR0_NSTPDR_MASK          (0x40000U)
#define ENETC_PORT_PRXDCRR0_NSTPDR_SHIFT         (18U)
#define ENETC_PORT_PRXDCRR0_NSTPDR_WIDTH         (1U)
#define ENETC_PORT_PRXDCRR0_NSTPDR(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_NSTPDR_SHIFT)) & ENETC_PORT_PRXDCRR0_NSTPDR_MASK)

#define ENETC_PORT_PRXDCRR0_NSTDDR_MASK          (0x80000U)
#define ENETC_PORT_PRXDCRR0_NSTDDR_SHIFT         (19U)
#define ENETC_PORT_PRXDCRR0_NSTDDR_WIDTH         (1U)
#define ENETC_PORT_PRXDCRR0_NSTDDR(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR0_NSTDDR_SHIFT)) & ENETC_PORT_PRXDCRR0_NSTDDR_MASK)
/*! @} */

/*! @name PRXDCRR1 - Port Rx discard count reason register 1 */
/*! @{ */

#define ENETC_PORT_PRXDCRR1_ENTRYID_MASK         (0xFFFFU)
#define ENETC_PORT_PRXDCRR1_ENTRYID_SHIFT        (0U)
#define ENETC_PORT_PRXDCRR1_ENTRYID_WIDTH        (16U)
#define ENETC_PORT_PRXDCRR1_ENTRYID(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR1_ENTRYID_SHIFT)) & ENETC_PORT_PRXDCRR1_ENTRYID_MASK)

#define ENETC_PORT_PRXDCRR1_TT_MASK              (0xF0000000U)
#define ENETC_PORT_PRXDCRR1_TT_SHIFT             (28U)
#define ENETC_PORT_PRXDCRR1_TT_WIDTH             (4U)
#define ENETC_PORT_PRXDCRR1_TT(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PRXDCRR1_TT_SHIFT)) & ENETC_PORT_PRXDCRR1_TT_MASK)
/*! @} */

/*! @name PTGSTCSR - Port time gate scheduling traffic class 0 status register..Port time gate scheduling traffic class 7 status register */
/*! @{ */

#define ENETC_PORT_PTGSTCSR_LH_STATE_MASK        (0x10000U)
#define ENETC_PORT_PTGSTCSR_LH_STATE_SHIFT       (16U)
#define ENETC_PORT_PTGSTCSR_LH_STATE_WIDTH       (1U)
#define ENETC_PORT_PTGSTCSR_LH_STATE(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTGSTCSR_LH_STATE_SHIFT)) & ENETC_PORT_PTGSTCSR_LH_STATE_MASK)
/*! @} */

/*! @name PTGSTCOCR - Port time gate scheduling traffic class 0 overrun counter register..Port time gate scheduling traffic class 7 overrun counter register */
/*! @{ */

#define ENETC_PORT_PTGSTCOCR_TX_OVERRUN_MASK     (0xFU)
#define ENETC_PORT_PTGSTCOCR_TX_OVERRUN_SHIFT    (0U)
#define ENETC_PORT_PTGSTCOCR_TX_OVERRUN_WIDTH    (4U)
#define ENETC_PORT_PTGSTCOCR_TX_OVERRUN(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTGSTCOCR_TX_OVERRUN_SHIFT)) & ENETC_PORT_PTGSTCOCR_TX_OVERRUN_MASK)
/*! @} */

/*! @name PTCTMSDUR - Port traffic class 0 transmit maximum SDU register..Port traffic class 7 transmit maximum SDU register */
/*! @{ */

#define ENETC_PORT_PTCTMSDUR_MAXSDU_MASK         (0xFFFFU)
#define ENETC_PORT_PTCTMSDUR_MAXSDU_SHIFT        (0U)
#define ENETC_PORT_PTCTMSDUR_MAXSDU_WIDTH        (16U)
#define ENETC_PORT_PTCTMSDUR_MAXSDU(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTCTMSDUR_MAXSDU_SHIFT)) & ENETC_PORT_PTCTMSDUR_MAXSDU_MASK)

#define ENETC_PORT_PTCTMSDUR_SDU_TYPE_MASK       (0x30000U)
#define ENETC_PORT_PTCTMSDUR_SDU_TYPE_SHIFT      (16U)
#define ENETC_PORT_PTCTMSDUR_SDU_TYPE_WIDTH      (2U)
#define ENETC_PORT_PTCTMSDUR_SDU_TYPE(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTCTMSDUR_SDU_TYPE_SHIFT)) & ENETC_PORT_PTCTMSDUR_SDU_TYPE_MASK)

#define ENETC_PORT_PTCTMSDUR_SF_MAXSDU_DIS_MASK  (0x1000000U)
#define ENETC_PORT_PTCTMSDUR_SF_MAXSDU_DIS_SHIFT (24U)
#define ENETC_PORT_PTCTMSDUR_SF_MAXSDU_DIS_WIDTH (1U)
#define ENETC_PORT_PTCTMSDUR_SF_MAXSDU_DIS(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTCTMSDUR_SF_MAXSDU_DIS_SHIFT)) & ENETC_PORT_PTCTMSDUR_SF_MAXSDU_DIS_MASK)
/*! @} */

/*! @name PTCCBSR0 - Port transmit traffic class 0 credit based shaper register 0..Port transmit traffic class 7 credit based shaper register 0 */
/*! @{ */

#define ENETC_PORT_PTCCBSR0_BW_MASK              (0x7FU)
#define ENETC_PORT_PTCCBSR0_BW_SHIFT             (0U)
#define ENETC_PORT_PTCCBSR0_BW_WIDTH             (7U)
#define ENETC_PORT_PTCCBSR0_BW(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTCCBSR0_BW_SHIFT)) & ENETC_PORT_PTCCBSR0_BW_MASK)

#define ENETC_PORT_PTCCBSR0_FRACT_MASK           (0xF0000U)
#define ENETC_PORT_PTCCBSR0_FRACT_SHIFT          (16U)
#define ENETC_PORT_PTCCBSR0_FRACT_WIDTH          (4U)
#define ENETC_PORT_PTCCBSR0_FRACT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTCCBSR0_FRACT_SHIFT)) & ENETC_PORT_PTCCBSR0_FRACT_MASK)

#define ENETC_PORT_PTCCBSR0_CBSE_MASK            (0x80000000U)
#define ENETC_PORT_PTCCBSR0_CBSE_SHIFT           (31U)
#define ENETC_PORT_PTCCBSR0_CBSE_WIDTH           (1U)
#define ENETC_PORT_PTCCBSR0_CBSE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTCCBSR0_CBSE_SHIFT)) & ENETC_PORT_PTCCBSR0_CBSE_MASK)
/*! @} */

/*! @name PTCCBSR1 - Port traffic class 0 credit based shaper register 1..Port traffic class 7 credit based shaper register 1 */
/*! @{ */

#define ENETC_PORT_PTCCBSR1_HI_CREDIT_MASK       (0xFFFFFFFFU)
#define ENETC_PORT_PTCCBSR1_HI_CREDIT_SHIFT      (0U)
#define ENETC_PORT_PTCCBSR1_HI_CREDIT_WIDTH      (32U)
#define ENETC_PORT_PTCCBSR1_HI_CREDIT(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTCCBSR1_HI_CREDIT_SHIFT)) & ENETC_PORT_PTCCBSR1_HI_CREDIT_MASK)
/*! @} */

/*! @name PTCCBSR2 - Port transmit traffic class 0 credit based shaper register 2..Port transmit traffic class 7 credit based shaper register 2 */
/*! @{ */

#define ENETC_PORT_PTCCBSR2_IDLESLOPE_MASK       (0x7FFFFFFU)
#define ENETC_PORT_PTCCBSR2_IDLESLOPE_SHIFT      (0U)
#define ENETC_PORT_PTCCBSR2_IDLESLOPE_WIDTH      (27U)
#define ENETC_PORT_PTCCBSR2_IDLESLOPE(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTCCBSR2_IDLESLOPE_SHIFT)) & ENETC_PORT_PTCCBSR2_IDLESLOPE_MASK)

#define ENETC_PORT_PTCCBSR2_CBSE_MASK            (0x80000000U)
#define ENETC_PORT_PTCCBSR2_CBSE_SHIFT           (31U)
#define ENETC_PORT_PTCCBSR2_CBSE_WIDTH           (1U)
#define ENETC_PORT_PTCCBSR2_CBSE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PTCCBSR2_CBSE_SHIFT)) & ENETC_PORT_PTCCBSR2_CBSE_MASK)
/*! @} */

