zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_PORT.h
/*! @name PPCPDEIMR - Port PCP DEI mapping register */
/*! @{ */

#define ENETC_PORT_PPCPDEIMR_IPCPMP_MASK         (0xFU)
#define ENETC_PORT_PPCPDEIMR_IPCPMP_SHIFT        (0U)
#define ENETC_PORT_PPCPDEIMR_IPCPMP_WIDTH        (4U)
#define ENETC_PORT_PPCPDEIMR_IPCPMP(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PPCPDEIMR_IPCPMP_SHIFT)) & ENETC_PORT_PPCPDEIMR_IPCPMP_MASK)

#define ENETC_PORT_PPCPDEIMR_IPCPMPV_MASK        (0x80U)
#define ENETC_PORT_PPCPDEIMR_IPCPMPV_SHIFT       (7U)
#define ENETC_PORT_PPCPDEIMR_IPCPMPV_WIDTH       (1U)
#define ENETC_PORT_PPCPDEIMR_IPCPMPV(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PPCPDEIMR_IPCPMPV_SHIFT)) & ENETC_PORT_PPCPDEIMR_IPCPMPV_MASK)

#define ENETC_PORT_PPCPDEIMR_EPCPMP_MASK         (0xF00U)
#define ENETC_PORT_PPCPDEIMR_EPCPMP_SHIFT        (8U)
#define ENETC_PORT_PPCPDEIMR_EPCPMP_WIDTH        (4U)
#define ENETC_PORT_PPCPDEIMR_EPCPMP(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PPCPDEIMR_EPCPMP_SHIFT)) & ENETC_PORT_PPCPDEIMR_EPCPMP_MASK)

#define ENETC_PORT_PPCPDEIMR_EPCPMPV_MASK        (0x8000U)
#define ENETC_PORT_PPCPDEIMR_EPCPMPV_SHIFT       (15U)
#define ENETC_PORT_PPCPDEIMR_EPCPMPV_WIDTH       (1U)
#define ENETC_PORT_PPCPDEIMR_EPCPMPV(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PPCPDEIMR_EPCPMPV_SHIFT)) & ENETC_PORT_PPCPDEIMR_EPCPMPV_MASK)

#define ENETC_PORT_PPCPDEIMR_DR0DEI_MASK         (0x10000U)
#define ENETC_PORT_PPCPDEIMR_DR0DEI_SHIFT        (16U)
#define ENETC_PORT_PPCPDEIMR_DR0DEI_WIDTH        (1U)
#define ENETC_PORT_PPCPDEIMR_DR0DEI(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PPCPDEIMR_DR0DEI_SHIFT)) & ENETC_PORT_PPCPDEIMR_DR0DEI_MASK)

#define ENETC_PORT_PPCPDEIMR_DR1DEI_MASK         (0x20000U)
#define ENETC_PORT_PPCPDEIMR_DR1DEI_SHIFT        (17U)
#define ENETC_PORT_PPCPDEIMR_DR1DEI_WIDTH        (1U)
#define ENETC_PORT_PPCPDEIMR_DR1DEI(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PPCPDEIMR_DR1DEI_SHIFT)) & ENETC_PORT_PPCPDEIMR_DR1DEI_MASK)

#define ENETC_PORT_PPCPDEIMR_DR2DEI_MASK         (0x40000U)
#define ENETC_PORT_PPCPDEIMR_DR2DEI_SHIFT        (18U)
#define ENETC_PORT_PPCPDEIMR_DR2DEI_WIDTH        (1U)
#define ENETC_PORT_PPCPDEIMR_DR2DEI(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PPCPDEIMR_DR2DEI_SHIFT)) & ENETC_PORT_PPCPDEIMR_DR2DEI_MASK)

#define ENETC_PORT_PPCPDEIMR_DR3DEI_MASK         (0x80000U)
#define ENETC_PORT_PPCPDEIMR_DR3DEI_SHIFT        (19U)
#define ENETC_PORT_PPCPDEIMR_DR3DEI_WIDTH        (1U)
#define ENETC_PORT_PPCPDEIMR_DR3DEI(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PPCPDEIMR_DR3DEI_SHIFT)) & ENETC_PORT_PPCPDEIMR_DR3DEI_MASK)

#define ENETC_PORT_PPCPDEIMR_DRME_MASK           (0x100000U)
#define ENETC_PORT_PPCPDEIMR_DRME_SHIFT          (20U)
#define ENETC_PORT_PPCPDEIMR_DRME_WIDTH          (1U)
#define ENETC_PORT_PPCPDEIMR_DRME(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PPCPDEIMR_DRME_SHIFT)) & ENETC_PORT_PPCPDEIMR_DRME_MASK)
/*! @} */

/*! @name PISIDCR - Port ingress stream identification configuration register */
/*! @{ */

#define ENETC_PORT_PISIDCR_KCPAIR_MASK           (0x1U)
#define ENETC_PORT_PISIDCR_KCPAIR_SHIFT          (0U)
#define ENETC_PORT_PISIDCR_KCPAIR_WIDTH          (1U)
#define ENETC_PORT_PISIDCR_KCPAIR(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PISIDCR_KCPAIR_SHIFT)) & ENETC_PORT_PISIDCR_KCPAIR_MASK)

#define ENETC_PORT_PISIDCR_KC0EN_MASK            (0x2U)
#define ENETC_PORT_PISIDCR_KC0EN_SHIFT           (1U)
#define ENETC_PORT_PISIDCR_KC0EN_WIDTH           (1U)
#define ENETC_PORT_PISIDCR_KC0EN(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PISIDCR_KC0EN_SHIFT)) & ENETC_PORT_PISIDCR_KC0EN_MASK)

#define ENETC_PORT_PISIDCR_KC1EN_MASK            (0x4U)
#define ENETC_PORT_PISIDCR_KC1EN_SHIFT           (2U)
#define ENETC_PORT_PISIDCR_KC1EN_WIDTH           (1U)
#define ENETC_PORT_PISIDCR_KC1EN(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PISIDCR_KC1EN_SHIFT)) & ENETC_PORT_PISIDCR_KC1EN_MASK)

#define ENETC_PORT_PISIDCR_ISEID_MASK            (0xFFFF0000U)
#define ENETC_PORT_PISIDCR_ISEID_SHIFT           (16U)
#define ENETC_PORT_PISIDCR_ISEID_WIDTH           (16U)
#define ENETC_PORT_PISIDCR_ISEID(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_PORT_PISIDCR_ISEID_SHIFT)) & ENETC_PORT_PISIDCR_ISEID_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group ENETC_PORT_Register_Masks */

/*!
 * @}
 */ /* end of group ENETC_PORT_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_ENETC_PORT_H_) */
